app/controllers/store_controller.rb

  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO "line_items" ("order_id", "updated_at", "total_price", "product_id", "quantity", "created_at") VALUES(1, '2009-03-04 23:51:22', 59.9, 8, 2, '2009-03-04 23:51:22')
INSERT INTO "orders" ("name", "updated_at", "pay_type", "address", "email", "created_at") VALUES('Joe John', '2009-03-04 23:51:22', 'cc', 'The Netherlands', 'j.j@jjohns.com', '2009-03-04 23:51:22')

  def index
  	@products = Product.find_products_for_sale
---
SELECT * FROM "products" ORDER BY title

  def add_to_cart
  	product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 8)