app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "hashed_password", "created_at") VALUES('Johnny Appleseed', '373286100.829835084481528', '2009-03-26 22:24:59', '4efb02aabf06d46f2c9ef68651aaba34f37dbd4e', '2009-03-26 22:24:59')